{
  "Games": {
    "Mafia": {
      "About": {
        "Title": "Об игре \"Мафия\"",
        "Description": "Мафия представляет собой ассиметричную психологическую командную пошаговую игру. В игре противоборствуют 2 стороны: мирные жители и мафия. Задача мирных жителей - избавиться от мафии до того, как мафия не убьет всех жителей.\nВ нулевую ночь игроки получают личное сообщение от бота, которое содержит выданную роль. После того, как все игроки получили свои роли, мафия и дон  знакомятся в отдельном канале. В нулевой день знакомятся все игроки. Голосование в нулевой день не проводится, город засыпает сразу. Дальше начинается цикл дня и ночи, в котором днём все жители выбирают, кого изгнать на голосовании; а ночью свои действия делают все игроки с активными ролями.\nИгра заканчивается, если мирные жители изгнали всю мафию, или если мафия убила всех жителей. (прим.: игра завершается при равном количестве черных и красных ролей, т.к. в данном случае у мирных жителей отсутствует перевес в количестве голосов)",
        "ImageUrl": "https://grand-club.by/wp-content/uploads/2019/02/glub-game.jpg"
      },
      "Roles": {
        "Title": "Состав игроков",
        "Innocent": {
          "Key": "Мирный житель",
          "Value": "Пассивная роль, не имеющая ночных действий. Большинство игроков за столом имеют именно эту роль. Основная задача мирных жителей - вычислять и выгонять мафию на дневном голосовании.",
          "Color": "0f5fff",
          "Order": 1
        },
        "Sheriff": {
          "Key": "Шериф",
          "Value": "Шериф является основной мирной ролью. Задача шерифа - вычислить мафию путем ночных проверок. За ночь шериф может проверить только одного игрока. Если указанный игрок является черной ролью, то шериф получает информацию, что данный игрок - мафия. Если же роль указанного игрока является красной, то шериф получает информацию, что игрок является мирным жителем. Также шериф имеет право 1 раз за игру вместо вычисления мафии выстрелить в любого игрока, кроме себя.",
          "Color": "c9a41e",
          "Order": 2
        },
        "Doctor": {
          "Key": "Доктор",
          "Value": "Доктор старается предугадать следующую жертву мафии и пытается спасти игрока от смерти. Игрок считается спасенным, если ход доктора совпал с ходом мафии и/или шерифа. За ночь доктор может вылечить одного игрока. Доктор не может лечить одного и того же игрока 2 раза подряд. Самого себя доктор может лечить 1 раз за игру.",
          "Color": "06a103",
          "Order": 3
        },
        "Murder": {
          "Key": "Мафиози",
          "Value": "Мафиози является основной черной ролью, целью которой является убийство всех мирных жителей. Жертва выбирается всеми мафиози на ночном голосовании. Если выбор мафиози расходится, то выстрела не происходит. Мафиози может застрелить сам себя, или другого мафиози. За одну ночь мафия может убить одного человека.",
          "Color": "de2f2f",
          "Order": 4
        },
        "Don": {
          "Key": "Дон",
          "Value": "Дон является главой мафии, поэтому в большинстве случаев выбор на голосовании предоставляется именно ему. После того, как мафия выбрала свою жертву, дон выясняет, кто из жителей является шерифом.",
          "Color": "b00c0c",
          "Order": 5
        },
        "Hooker": {
          "Key": "Путана",
          "Value": "Путана – нейтральная роль. Она играет за себя и ее задача - сохранить за игровым столом как можно больше жителей.\nНочью игрок выбирает игрока, который будет охмурен путаной. Охмуренный игрок получает следующие эффекты:\n1 - Данный игрок не умрет, если в него выстрелит кто-либо\n2 - У игрока блокируется активное действие. Данный игрок получит сообщение, что он охмурен Путаной.\n3 - Игрок получает Алиби - защиту от изгнания на голосовании. Если город выберет данного игрока, то в чат отправится сообщение о невозможности изгнания игрока.\n4 - Если ночью убивают путану, то вместе с ней умирает и охмуренный игрок.\nЕсли Путана сходила к маньяку, то или в общий чат или в чат игры, в зависимости от настроек, отправится сообщение, раскрывающее игрока с ролью Маньяка",
          "Color": "a14f6d",
          "Order": 6
        },
        "Maniac": {
          "Key": "Маньяк",
          "Value": "Маньяк играет за нейтральную сторону. Его задача - убить всех игроков за столом и остаться одному. Каждую ночь маньяк может убить одного жителя, или пропустить ход. Также, в зависимости от настроек игры, маньяк может игнорировать лечение доктора.",
          "Color": "577866",
          "Order": 7
        }
      },
      "Details": {
        "Title": "Подробности игры \"Мафия\"",
        "Part1": {
          "Description": "Запуск игры происходит в 4 этапа",
          "1SetupGuild": {
            "Key": "1) Подготовка сервера",
            "Value": "Создается 6 каналов для игры (далее - каналы мафии):\n- Текстовый канал для всех игроков\n- Голосовой канал для всех игроков\n- Текстовый канал для мафиози\n- Голосовой канал для мафиози\n- Текстовый канал для наблюдателей\n- Голосовой канал для наблюдателей\n\nЗатем создается 2 роли:\n- Игрок мафии\n- Наблюдатель мафии\n\nРоль **Игрок Мафии** получает переопределения во всех каналах сервера, кроме каналов мафии, чтобы гарантировать невозможность игрока видеть какой-либо канал, кроме специально подготовленных. Также роль Игрок Мафии по умолчанию имеет только 2 разрешения в основном канале мафии: **чтение истории сообщений** и **возможность видеть канал**. Возможность отправлять сообщения регулируется во время игры (п. **Цикл игры**)."
          },
          "2Setup0s": {
            "Key": "2) Подготовка участников",
            "Value": "- Со всех участников снимаются все роли\n- При отсутствии серверного ника у игрока ему ставится ник аккаунта в формате **\\_никнейм\\_**\n- Игрокам выдается роль **Игрок Мафии**\n- Игроки получают приветственное сообщение от бота в личные сообщения (далее - лс)"
          },
          "3SetupGameRoles": {
            "Key": "3) Выдача игровых ролей",
            "Value": "Случайным образом выбираются активные красные роли, затем из оставшихся игроков случайным образом выбираются черные роли. Оставшиеся игроки являются мирными жителями."
          },
          "4Notify0s": {
            "Key": "4) Уведомление игроков",
            "Value": "Всем игрокам отправляется сообщение с выданной ролью."
          },
          "PostParagraph": "Дальше начинается непосредственно игра: игроки знакомятся, выполняют ночные действия, вычисляют мафию и борятся за победу."
        },
        "Part2": {
          "Title": "Цикл игры",
          "1ZeroNight": {
            "Key": "Нулевая ночь",
            "Value": "Игра начинается с нулевой ночи: мирные игроки попадают в основной канал игры, в котором ожидают наступления утра. Мафиози получают доступ к каналам для мафии (доступ производится выдачей переопределений прав пользователю), в которых вся мафия знакомится друг с другом."
          },
          "2ZeroDay": {
            "Key": "Нулевой день",
            "Value": "После нулевой ночи наступает нулевой день. Все игроки знакомятся друг с другом. Игрокам доступен текстовый и голосовой канал (далее - гс). Когда день закончен, все игроки (далее - город) засыпают (т.е. им блокируется возможность отправлять сообщения и находиться в гс)"
          },
          "3StandartNight": {
            "Key": "Стандартная ночь",
            "Value": "После голосования наступает ночь. Ночью играют только активные роли - мирные жители спят. Мафиози получают доступ к своим каналам, и они обсуждают свою следующую жертву. После обсуждения мафия голосует кого убить. После голосования мафия засыпает. В это же время вместе с мафией голосуют и активные мирные роли. Их взаимодействие происходит через лс бота аналогичным образом. Когда мафия сделала свой ход, дон мафии также через лс бота делает свой выбор. Когда все активные роли сделали свой ход, наступает стандартный день."
          },
          "4StandartDay": {
            "Key": "Стандартный день",
            "Value": "Перед началом дня бот объявляет результаты ночи: если трупов нет, то выводится сообщения, что все живы, иначе бот упоминает убитых игроков. Убитым игрокам возвращаются их роли, убирается серверный ник, если он ставился, выдается роль Наблюдатель мафии, которая предоставляет доступ в каналы для наблюдателей. После этого начинается обсуждение. После обсуждения игроки выбирают игрока, который покинет игру. Если мирные жители не выбрали игрока, то никто не покидает игру. После голосования город засыпает, и снова наступает ночь. Данный цикл игры длится до тех пор, пока не победят мирные или мафия."
          },
          "5EndGame": {
            "Key": "Конец игры",
            "Value": "После окончания игры над живыми игроками производят те же действия, что и над убитыми игроками, кроме выдачи роли наблюдателя, рассчитываются очки, полученные за игру. Далее в канале, где была начата мафия, объявляются результаты игры."
          }
        }
      },
      "GameRoles": {
        "Innocent": {
          "Name": "Мирный житель",
          "Priority": 0,
          "Phrases": {
            "YourMove": [
              "Кто сегодня погибнет от мирной руки?"
            ],
            "Success": [
              "Вы попробуете убить {0} этой ночью"
            ],
            "Failure": [
              "Сегодня никто не увидит вас с кровавым ножом в руке"
            ]
          }
        },
        "Doctor": {
          "Name": "Доктор",
          "Priority": 0,
          "Phrases": {
            "YourMove": [
              "Кто сегодня получит медицинскую помощь?"
            ],
            "Success": [
              "Вы вылечите {0} этой ночью"
            ],
            "Failure": [
              "Сегодня никто не получит медицинскую помощь"
            ]
          }
        },
        "Sheriff": {
          "Name": "Шериф",
          "Priority": 0,
          "Phrases": {
            "YourMove": [
              "К кому наведаемся этой ночью?"
            ],
            "Success": [
              "Этой ночью вы отправитесь к {0}"
            ],
            "Failure": [
              "Сегодня вы ни к кому не придете"
            ],
            "SuccessfullKill": [
              "Ваш магнум заряжен, {0} вряд-ли переживет эту ночь"
            ],
            "FailedKill": [
              "Вы забыли зарядить свое оружие. Вы никого не убьете"
            ],
            "SuccessfullCheck": [
              "Вы раскрыли личность {0}! Он - {1}"
            ],
            "FailedCheck": [
              "{0} не является мафией"
            ]
          }
        },
        "Murder": {
          "Name": "Мафиози",
          "Priority": 0,
          "Phrases": {
            "YourMove": [
              "Кто умрет этой ночью?"
            ],
            "Success": [
              "Вы зарядили свой револьвер для {0}"
            ],
            "Failure": [
              "Вы никого не убьете этой ночью"
            ]
          }
        },
        "Don": {
          "Name": "Дон",
          "Priority": -1,
          "Phrases": {
            "YourMove": [
              "К кому сегодня наведаемся с проверкой?"
            ],
            "Success": [
              "Вы идете к {0} с парочкой вопросов"
            ],
            "Failure": [
              "Сегодня никто не откроет вам дверь"
            ],
            "SuccessfullCheck": [
              "Вы раскусили {0}! Он - {1}"
            ],
            "FailedCheck": [
              "{0} не тот, кого вы ищите"
            ]
          }
        },
        "Maniac": {
          "Name": "Маньяк",
          "Priority": 0,
          "Phrases": {
            "YourMove": [
              "Кто сегодня отправится на тот свет?"
            ],
            "Success": [
              "Вы приготовили свой кинжал для {0}"
            ],
            "Failure": [
              "Вы решили ненадолго залечь на дно"
            ]
          }
        },
        "Hooker": {
          "Name": "Путана",
          "Priority": 1,
          "Phrases": {
            "YourMove": [
              "С кем сегодня будем развлекаться?"
            ],
            "Success": [
              "{0} уже ждет вас"
            ],
            "Failure": [
              "Вы решили взять сегодня выходной"
            ]
          }
        },
        "CitizenGroup": {
          "Name": "Город",
          "Priority": 0,
          "Phrases": {
            "YourMove": [
              "Кто сегодня будет публично казнен?"
            ],
            "Success": [
              "Вы изгнали {0}"
            ],
            "Failure": [
              "Никто не будет изгнан"
            ]
          }
        },
        "MurdersGroup": {
          "Name": "Мафия",
          "Priority": 0,
          "Phrases": {
            "YourMove": [
              "Кто сегодня умрет ночью?"
            ],
            "Success": [
              "Вы убьете {0} этой ночью"
            ],
            "Failure": [
              "Сегодня никто не умрет"
            ]
          }
        }
      }
    },
    "RussianRoulette": {
      "About": {
        "Title": "Об игре \"Русская рулетка\"",
        "Description": "Русская рулетка является экстремальной азартной игрой или пари с летальным исходом. По правилам игры в пустой барабан револьвера заряжается один или несколько патронов с тем, чтобы остались свободные каморы, после чего барабан несколько раз проворачивается так, чтобы игроки не знали, где располагаются патроны. После этого игроки по очереди подносят ствол револьвера к собственной голове и нажимают на спусковой крючок.",
        "ImageUrl": "https://cs11.pikabu.ru/post_img/big/2018/07/13/9/1531496099187696654.jpg"
      },
      "Details": {
        "Title": "Подробности игры \"Русская рулетка\"",
        "Part1": {
          "1GameGoal": {
            "Key": "Цель игры",
            "Value": "Основная цель игры: остаться единственным выжившим. Игроки не предпринимают активных действий, а просто наблюдают за своей судьбой в рулетке."
          },
          "2Implementation": {
            "Key": "Как устроено",
            "Value": "⠀Каждый круг список игроков перемешивается для более равномерного шанса на победу. Каждый ход по формуле вероятности рассчитывается % выстрела револьвера. Если данная вероятность сбывается, то игрок умирает, иначе ход переходит следующему игроку по кругу.\n⠀Формула расчета вероятности выстрела выглядит так:\nP = n/N, где P - вероятность выстрела, n - количество ходов, N - количество гнезд в барабане. Данная формула отличается от стандартной модели русской рулетки ввиду повышения интереса к игре. Для сравнения % выстрела по используемой в рулетке формуле (формула 1) и стандартной (формула 2):```\nХод \tФормула 1 \tФормула 2\n1\tP ≈ 17%\t P ≈ 17%\n2\tP ≈ 33%\t P = 20%\n3\tP = 50%\t P = 25%\n4\tP ≈ 67%\t P ≈ 33%\n5\tP ≈ 83%\t P = 50%\n6\tP = 100%\tP = 100%```\nКогда в живых остается 1 игрок, игра завершается и выжившему игроку зачисляется победа в его статистику."
          }
        }
      }
    }
  }
}