Repository: Oleg-Sergeev/ElMafio
Catalog: Core/Resources/Resource.*.resx
Languages: ru

# AbortGameWhenError_Description
source: If an error occurs during game preparation, the game will crash
ru: Если во время подготовки к игре произошла ошибка, игра аварийно прервется

# AbortGameWhenError_Name
source: Abort game when setup error
ru: Прерывать игру после ошибки подготовки

source: Block
ru: Блок

source: Cancel
ru: Отмена

# CanInnocentsKillAtNight_Description
source: Civilians get the opportunity to kill any player by voting
ru: Мирные жители получают возможность путем голосования убить любого игрока

# CanInnocentsKillAtNight_Name
source: Civilians can kill at night
ru: Мирные могут убивать ночью

# CategoryChannelId_Description
source: The category will allow you to group all game channels
ru: Категория позволит сгруппировать все игровые каналы

# CategoryChannelId_Name
source: Category ID
ru: ID Категории

# ChangeParameterValueForConflictSolve
source: Change the value of one or two parameters to resolve the conflict
ru: Измените значение одного или двух параметров для устранения конфликта

source: Changes not found
ru: Изменения не найдены

# ClearChannelsOnStart_Description
source: Before the start of the game, the bot will clear all channels from past discussions
ru: Перед стартом игры бот очистит все каналы от прошлых обсуждений

# ClearChannelsOnStart_Name
source: Clear channels before starting the game
ru: Очищать каналы перед стартом игры

source: Close
ru: Закрыть

# ConditionAliveAtLeast1Innocent_Description
source: If this option is enabled, the game will end only when the last peaceful card dies
ru: Если опция включена, игра закончится только при смерти последней мирной карты

# ConditionAliveAtLeast1Innocent_Name
source: Continue the game until the last peaceful
ru: Продолжать игру до последнего мирного

# ConditionContinueGameWithNeutrals_Description
source: If the option is enabled, the game will not end after the death of all the mafia
ru: Если опция включена, игра не завершится после смерти всех мафиозников

# ConditionContinueGameWithNeutrals_Name
source: Continue playing with neutrals
ru: Продолжать игру с нейтралами

# DoctorsCount_Name
source: Doctors count
ru: Количество докторов

# DoctorSelfHealsCount_Description
source: Sets number of self-healing. *Doctor cannot heal any player 2 times in a row*
ru: Устанавливает любое кол-во самолечений. *Доктор не может лечить любого игрока 2 раза подряд*

# DoctorSelfHealsCount_Name
source: Doctor self heals count
ru: Количество самолечений доктора

# DonsCount_Name
source: Dons count
ru: Количество донов

# FailedSetParameterValue
source: Failed to set parameter value **{0}**
ru: Не удалось установить значение параметра **{0}**

# GameBlock
source: Game
ru: Игра

# GeneralBlock
source: General
ru: Общее

# GeneralTextChannelId_Description
source: In this channel there is a daily discussion and voting
ru: В этом канале происходит дневное обсуждение и голосование

# GeneralTextChannelId_Name
source: General text channel ID
ru: ID Основного текстового канала

# GeneralVoiceChannelId_Description
source: Voice channel open during afternoon discussion
ru: Голосовой канал открыт во время дневного обсуждения

# GeneralVoiceChannelId_Name
source: General voice channel ID
ru: ID Основного голосового канала

# HookersCount_Name
source: Hookers count
ru: Количество путан

# InnocentsCount_Name
source: Innocents count
ru: Количество мирных

# InnocentsMustVoteForOnePlayer_Description
source: All civilians are required to vote in one player. *Votes without a clear choice do not count*
ru: Все мирные жители обязаны проголосовать в одного игрока. *Голоса без четкого выбора не учитываются*

# InnocentsMustVoteForOnePlayer_Name
source: Civilians must vote unanimously
ru: Мирные обязаны проголосовать единогласно

source: Invalid parameter value
ru: Неверное значение параметра

# IsCustomGame_Description
source: Apply custom game settings. **Not compatible with ranked play**
ru: Применять пользовательские настройки игры. **Несовместимо с рейтинговой игрой**

# IsCustomGame_Name
source: Custom game
ru: Пользовательская игра

# IsFillWithMurders_Description
source: By default, the table is filled with civilians. This option fills the table with mafia
ru: По умолчанию стол заполняется мирными жителями. Данная опция заполняет стол мафией

# IsFillWithMurders_Name
source: Fill table with mafia
ru: Заполнять стол мафией

# IsRatingGame_Description
source: Determines whether to take into account the next game in the statistics and rating of players
ru: Определяет, учитывать ли очередную игру в статистике и рейтинге игроков

# IsRatingGame_Name
source: Rating game
ru: Рейтинговая игра

# LastWordNightCount_Description
source: Number of nights after which a killed player can send a posthumous message
ru: Кол-во ночей, после которых убитый игрок сможет отправить посмертное сообщение

# LastWordNightCount_Name
source: Number of last words
ru: Кол-во последних слов

# MafiaCoefError
source: Mafia coefficient cannot be less than {0}
ru: Коэффициент мафии не может быть меньше {0}

# MafiaCoefficient_Description
source: Determines ratio of civilians to the mafia by the formula: maf = players / coef. Example: 2 = 8 / 3
ru: Определяет отношение мирных к мафии по формуле: маф = игроки / коэф. Пример: 2 = 8 / 3

# MafiaCoefficient_Name
source: Mafia coefficient
ru: Коэффициент мафии

# MafiaRoleId_Description
source: The main role required for the correct operation of the game
ru: Основная роль, необходимая для корректной работы игры

# MafiaRoleId_Name
source: Mafia Role ID
ru: ID Роли Мафии

# MafiaSettingsBlockSelect
source: Select the block of settings you are interested in
ru: Выберите интересующий вас блок настроек

# ManiacsCount_Name
source: Maniacs count
ru: Количество маньяков

# MentionPlayersOnGameStart_Description
source: At the start of the game, the bot will send a message mentioning all the participants in the game
ru: При старте игре бот пришлет сообщение с упоминанием всех участников игры

# MentionPlayersOnGameStart_Name
source: Mention players on game start
ru: Упоминать игроков после старта игры

# MurdersCount_Name
source: Murders count
ru: Количество мафий

# MurdersKnowEachOther_Description
source: Mafia will have a another chat available, where members of mafia can to know their teammates
ru: Мафии будет доступен отдельный чат, где члены мафии смогут знать своих сокомандников

# MurdersKnowEachOther_Name
source: Murders know each other
ru: Мафия знает друг друга

# MurdersMustVoteForOnePlayer_Description
source: The entire mafia is required to vote in one player. *Votes without a clear choice do not count*
ru: Вся мафия обязана проголосовать в одного игрока. *Голоса без четкого выбора не учитываются*

# MurdersMustVoteForOnePlayer_Name
source: Mafia must vote unanimously
ru: Мафия обязана проголосовать единогласно

# MurdersTextChannelId_Description
source: Here the mafia decides who to kill
ru: Здесь мафия принимает решение кого убивать

# MurdersTextChannelId_Name
source: Mafia Text Channel ID
ru: ID Текстового канала Мафии

# MurdersVoiceChannelId_Description
source: Mafia can discuss their night plans in this channel
ru: Мафия может обсудить свои ночные планы в этом канале

# MurdersVoiceChannelId_Name
source: Mafia Voice Channel ID
ru: ID Голосового канала Мафии

# MurdersVoteTogether_Description
source: If option is disabled the mafia will vote individually through bot's DM and result will be summed up
ru: Если опция выключена, мафия будет голосовать по отдельности через лс бота, а результат суммироваться

# MurdersVoteTogether_Name
source: Murders vote together
ru: Мафия голосует вместе

source: *No description*
ru: *Описание отсутствует*

# NotAssigned
source: N/A
ru: Н/Д

source: Parameter
ru: Параметр

# ParameterSelect
source: Select the parameter you are interested in
ru: Выберите интересующий вас параметр

# PreGameMessage_Description
source: A message that will be shown before the game. Useful for a brief description of the settings used
ru: Сообщение, которое будет показано перед игрой. Полезно для краткого описания используемых настроек

# PreGameMessage_Name
source: Preamble
ru: Преамбула

# RemoveRolesFromUsers_Description
source: The absence of roles for the player ensures that he will only see game chats
ru: Отсутствие ролей у игрока гарантирует, что он будет видеть только игровые чаты

# RemoveRolesFromUsers_Name
source: Remove roles from users
ru: Убрать роли у игроков

# RenameUsers_Name
source: Rename users without server nickname
ru: Переименовывать игроков без серверного ника

# ReplyMessagesOnSetupError_Description
source: Used to prevent situations with nickname changes during the game
ru: При возникновении ошибки во время подготовки сообщение будет отправлено в чат

# ReplyMessagesOnSetupError_Name
source: Reply messages on setup error
ru: Отправлять сообщения об ошибках подготовки

# RolesAmountBlock
source: Roles amount
ru: Состав ролей

# RolesExtraInfoBlock
source: Roles extra settings
ru: Доп. настройки ролей

# SendWelcomeMessage_Description
source: Immediately after the start of the game, the bot will send a welcome message
ru: Сразу после старта игры бот отправит приветственное сообщение

# SendWelcomeMessage_Name
source: Send welcome message
ru: Отправлять приветственное сообщение

# ServerBlock
source: Server
ru: Сервер

source: Settings
ru: Настройки

source: Settings conflict
ru: Конфликт настроек

source: Settings error
ru: Ошибка настроек

source: Settings successfully saved
ru: Настройки успешно сохранены

# SheriffsCount_Name
source: Sheriffs count
ru: Количество шерифов

# SheriffShotsCount_Description
source: If sheriff is available to shot, before voting, player will have a choice of action: shoot or check
ru: Если шерифу доступен выстрел, перед голосованием у игрока будет выбор действия: выстрел или проверка

# SheriffShotsCount_Name
source: Sheriff shots count
ru: Количество выстрелов у шерифа

# SpecifyValue
source: Specify the value of the selected parameter **{0}**
ru: Укажите значение выбранного параметра **{0}**

# SpectatorsTextChannelId_Description
source: Killed players can watch the game progress and try to guess the roles
ru: Убитые игроки могут посмотреть за ходом игры и попробовать угадать роли

# SpectatorsTextChannelId_Name
source: Spectator Text Channel ID
ru: ID Текстового канала Наблюдаталей

# SpectatorsVoiceChannelId_Description
source: Observers can discuss the game by voice
ru: Наблюдатели могут голосом обсудить игру

# SpectatorsVoiceChannelId_Name
source: Spectator Voice Channel ID
ru: ID Голосового канала Наблюдаталей

# TheOptionsMutuallyExclusive
source: Options {0} and {1} are mutually exclusive
ru: Параметры {0} и {1} взаимоисключают друг друга

source: Value
ru: Значение

# ValueChanged
source: The value of **{0}** was successfully changed:
ru: Значение **{0}** успешно изменено:

# ValueNotSpecified
source: You did not specify a value for the parameter **{0}**
ru: Вы не указали значение параметра **{0}**

source: Values match
ru: Значения совпадают

# VoteTimeError
source: Voting time cannot be less than {0} seconds
ru: Время голосования не может быть меньше {0} секунд

# VoteTime_Description
source: The time that is given to a person for night and day voting
ru: Время, которое дается человеку для ночного и дневного голосования

# VoteTime_Name
source: Vote time
ru: Время голосования

# WatcherRoleId_Description
source: Role for spectators
ru: Роль для наблюдателей

# WatcherRoleId_Name
source: Mafia Spectator Role ID
ru: ID Роли Наблюдателя мафии
